In [1]:
# import libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
path = r'C:\Users\Saskia\Desktop\new'

In [3]:
df_cust = pd.read_csv(os.path.join(r'C:\Users\Saskia\Desktop\new\02 Data\Original Data\customers.csv'), index_col = False)

In [4]:
df_cust.shape

(206209, 10)

In [5]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
# Rename names 

df_cust.rename(columns = {'surnam': 'last_name'}, inplace=True)

In [7]:
df_cust.rename(columns = {'First Name': 'first_name'}, inplace=True)

In [8]:
df_cust.rename(columns = {'Gender': 'gender'}, inplace=True)

In [9]:
df_cust.rename(columns = {'STATE': 'state'}, inplace=True)

In [10]:
df_cust.rename(columns = {'Age': 'age'}, inplace=True)

In [11]:
df_cust.rename(columns = {'n_dependants': '#_dependants'}, inplace=True)

In [12]:
df_cust.rename(columns = {'fam_status': 'marital_status'}, inplace=True)

In [13]:
df_cust.head()

,user_id,first_name,Surnam,gender,state,age,date_joined,#_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [14]:
# Checking for missing values and duplicates

df_cust.columns

Index(['user_id', 'first_name', 'Surnam', 'gender', 'state', 'age',
       'date_joined', '#_dependants', 'marital_status', 'income'],
      dtype='object')

In [15]:
# Duplicates

df_cust[df_cust.duplicated()]

Empty DataFrame
Columns: [user_id, first_name, Surnam, gender, state, age, date_joined, #_dependants, marital_status, income]
Index: []

In [16]:
# missing values

df_cust.isnull().sum()

user_id               0
first_name        11259
Surnam                0
gender                0
state                 0
age                   0
date_joined           0
#_dependants          0
marital_status        0
income                0
dtype: int64

In [17]:
# missing values in first_name

df_nan_fn = df_cust['first_name'].isnull() == True

In [18]:
df_nan_fn

0         False
1         False
2         False
3         False
4         False
          ...
206204    False
206205    False
206206    False
206207    False
206208    False
Name: first_name, Length: 206209, dtype: bool

In [19]:
# Check duplicates for first_name

df_drop_fn = df_cust.drop(columns=['first_name'], axis=1)

In [20]:
df_drop_fn.head()

,user_id,Surnam,gender,state,age,date_joined,#_dependants,marital_status,income
0,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [21]:
df_drop_fn[df_drop_fn.duplicated()]

Empty DataFrame
Columns: [user_id, Surnam, gender, state, age, date_joined, #_dependants, marital_status, income]
Index: []

In [22]:
# Mixed data

for col in df_cust.columns.tolist():
    weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis =1)
    if len (df_cust[weird]) > 0:
        print (col)

first_name

In [23]:
# reassign to string
df_cust['first_name'] = df_cust['first_name'].astype('str')

In [24]:
# output

for col in df_cust.columns.tolist():
    weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis =1)
    if len (df_cust[weird]) > 0:
        print (col)

In [25]:
df_cust.dtypes

user_id            int64
first_name        object
Surnam            object
gender            object
state             object
age                int64
date_joined       object
#_dependants       int64
marital_status    object
income             int64
dtype: object

In [26]:
df_cust.head()

,user_id,first_name,Surnam,gender,state,age,date_joined,#_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [27]:
df_cust.shape

(206209, 10)

In [29]:
df_cust['age'] = df_cust['age'].astype('int8')

In [30]:
df_cust['#_depndants'] = df_cust['#_dependants'].astype('int8')

In [31]:
df_cust['income'] = df_cust['income'].astype('int32')

In [32]:
df_cust['user_id'] = df_cust['user_id'].astype('str')

In [33]:
df_cust.dtypes

user_id           object
first_name        object
Surnam            object
gender            object
state             object
age                 int8
date_joined       object
#_dependants       int64
marital_status    object
income             int32
#_depndants         int8
dtype: object

In [34]:
ords_prod_merge = pd.read_pickle(r'C:\Users\Saskia\Desktop\new\02 Data\Prepared Data\orders__products_merge_final.pkl')

In [35]:
ords_prod_merge.shape

(32434212, 26)

In [36]:
ords_prod_merge['user_id'] = ords_prod_merge['user_id'].astype('str')

In [37]:
ords_prod_merge.dtypes

Unnamed: 0                   int32
product_id                   int32
product_name                object
aisle_id                     int32
department_id                int32
prices                     float64
order_id                      int8
user_id                     object
eval_set                    object
order_number                  int8
orders_day_of_week            int8
order_time_of_day             int8
days_since_prior_order     float64
add_to_cart_order            int32
reordered                    int32
_merge                    category
busiest_day                 object
busiest days                object
busiest_days                object
busiest_period_of_day       object
max_order                     int8
loyalty_flag                object
average_spending           float64
spending_flag               object
purchase_frequency         float64
frequency_flag              object
dtype: object

In [38]:
ords_new_merge = ords_prod_merge.merge(df_cust, on = 'user_id')

In [39]:
ords_new_merge.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,eval_set,order_number,...,first_name,Surnam,gender,state,age,date_joined,#_dependants,marital_status,income,#_depndants
0,0,1,Chocolate Sandwich Cookies,61,19,5.8,65,9,prior,16,...,Nicole,Conrad,Male,District of Columbia,79,1/16/2020,3,married,154743,3
1,0,1,Chocolate Sandwich Cookies,61,19,5.8,-103,9,prior,2,...,Nicole,Conrad,Male,District of Columbia,79,1/16/2020,3,married,154743,3
2,0,1,Chocolate Sandwich Cookies,61,19,5.8,113,9,prior,4,...,Nicole,Conrad,Male,District of Columbia,79,1/16/2020,3,married,154743,3
3,0,1,Chocolate Sandwich Cookies,61,19,5.8,-67,9,prior,6,...,Nicole,Conrad,Male,District of Columbia,79,1/16/2020,3,married,154743,3
4,0,1,Chocolate Sandwich Cookies,61,19,5.8,-12,9,prior,7,...,Nicole,Conrad,Male,District of Columbia,79,1/16/2020,3,married,154743,3

In [40]:
ords_new_merge.shape

(16153014, 36)

In [41]:
# Export new merged file as pkl

ords_new_merge.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'Full_data.pkl'))